Revit.Elements.Wall.ByCurveAndLevels(Autodesk.DesignScript.Geometry.Curve,Revit.Elements.Level,Revit.Elements.Level,Revit.Elements.WallType)
Create a Revit Wall from a guiding Curve, start Level, end Level, and WallType
curve:
startLevel:
endLevel:
wallType:
Returns: